com.carpcap.hvp.annotation.CAccount.message = \u0E2B\u0E31\u0E27\u0E2B\u0E32\u0E27\u0E01\u0E32\u0E23\u0E40\u0E01\u0E37\u0E48\u0E2D\u0E40\u0E01\u0E37\u0E48\u0E2D \u0E40\u0E01\u0E37\u0E48\u0E2D\u0E40\u0E01\u0E34\u0E48\u0E07 \u0E44\u0E21\u0E48 {min}-{max} \u0E2A\u0E32\u0E27\u0E19 \u0E2A\u0E31\u0E27 \u0E43\u0E19 \u0E01\u0E32\u0E23, \u0E40\u0E01\u0E37\u0E48\u0E2D\u0E44\u0E21\u0E48 \u0E40\u0E2D\u0E37\u0E48\u0E2D, \u0E40\u0E01\u0E37\u0E48\u0E2D, \u0E40\u0E2B\u0E48\u0E2D\u0E07 \u0E40\u0E01\u0E37\u0E48\u0E2D \u0E2A\u0E31\u0E27\u0E19 \u0E43\u0E19.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CDateRange.message = \u0E2A\u0E32\u0E27\u0E08\u0E31\u0E19 \u0E44\u0E21\u0E48 \u0E2D\u0E31\u0E19 \u0E43\u0E19 \u0E40\u0E2B\u0E25\u0E37\u0E48\u0E2D. allowed range: ${min =='' ? '*' : min} ~ ${max =='' ? '*' : max}. ${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CDomain.message = \u0E44\u0E21\u0E48\u0E40\u0E2D\u0E37\u0E48\u0E2D \u0E14\u0E35\u0E25\u0E37\u0E2D\u0E15\u0E48\u0E2D \u0E2D\u0E19\u0E37\u0E48\u0E2D\u0E19\u0E31\u0E49\u0E07.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CFile.message = \u0E40\u0E2B\u0E25\u0E37\u0E48\u0E2D \u0E1C\u0E48\u0E32\u0E19\u0E49\u0E33 \u0E2A\u0E32\u0E27 \u0E43\u0E19 \u0E2D\u0E31\u0E19 \u0E44\u0E21\u0E48 \u0E2D\u0E31\u0E19 \u0E40\u0E2B\u0E25\u0E37\u0E48\u0E2D.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CIdCard.message = \u0E2A\u0E32\u0E27\u0E08\u0E31\u0E19 \u0E44\u0E21\u0E48 \u0E01\u0E32\u0E23\u0E40\u0E01\u0E37\u0E48\u0E2D \u0E2A\u0E31\u0E27 \u0E2B\u0E32\u0E22.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CIpv4.message = IP \u0E40\u0E01\u0E37\u0E48\u0E2D \u0E44\u0E21\u0E48 \u0E43\u0E19 \u0E2D\u0E31\u0E19 IPv4 \u0E43\u0E19 \u0E44\u0E21\u0E48.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CIpv6.message =  IP \u0E40\u0E01\u0E37\u0E48\u0E2D \u0E44\u0E21\u0E48 \u0E43\u0E19 \u0E2D\u0E31\u0E19 IPv6 \u0E43\u0E19 \u0E44\u0E21\u0E48.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CPassword.message = \u0E44\u0E21\u0E48 \u0E40\u0E01\u0E37\u0E48\u0E2D \u0E44\u0E21\u0E48 \u0E2A\u0E32\u0E27\u0E19 \u0E08\u0E31\u0E19\u0E2D\u0E4C \u0E01\u0E31\u0E19\u0E2D\u0E25\u0E31\u0E19 \u0E01\u0E32\u0E23\u0E40\u0E01\u0E37\u0E48\u0E2D \u0E44\u0E21\u0E48 {min}-{max}, \u0E22\u0E31\u0E48\u0E07 \u0E32\u0E35\u0E49\u0E25\u0E31\u0E19 1 \u0E01\u0E32\u0E23\u0E40\u0E01\u0E37\u0E48\u0E2D, \u0E22\u0E31\u0E48\u0E07 \u0E32\u0E35\u0E49\u0E25\u0E31\u0E19 1 \u0E01\u0E31\u0E19\u0E2D\u0E25\u0E31\u0E19.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CPhone.message = \u0E40\u0E01\u0E37\u0E48\u0E2D \u0E44\u0E21\u0E48 \u0E40\u0E01\u0E37\u0E48\u0E2D \u0E2B\u0E32\u0E27\u0E2B\u0E32\u0E27 \u0E40\u0E01\u0E37\u0E48\u0E2D \u0E2A\u0E32\u0E27 \u0E2B\u0E32\u0E27 \u0E44\u0E21\u0E48.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CPlateNumber.message = \u0E40\u0E01\u0E37\u0E48\u0E2D \u0E40\u0E2B\u0E48\u0E2D\u0E07 \u0E40\u0E01\u0E37\u0E48\u0E2D \u0E2A\u0E32\u0E27 \u0E2B\u0E32\u0E27 \u0E44\u0E21\u0E48.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CUrl.message = \u0E23\u0E31\u0E1A\u0E1A\u0E2D\u0E2B\u0E19 URL \u0E44\u0E21\u0E48 \u0E43\u0E19 \u0E2D\u0E31\u0E19.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CMacAddress.message = \u0E23\u0E31\u0E1A\u0E1A\u0E2D\u0E2B\u0E19\u0E17\u0E35\u0E48\u0E2D\u0E25\u0E37\u0E2D MAC \u0E44\u0E21\u0E48 \u0E43\u0E19 \u0E2D\u0E31\u0E19.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CMoney.message = \u0E23\u0E31\u0E1A\u0E1A\u0E2D\u0E2B\u0E19\u0E17\u0E34\u0E15\u0E49\u0E07\u0E44\u0E21\u0E48\u0E2A\u0E31\u0E27\u0E23\u0E4C\u0E01\u0E31\u0E19\u0E2D\u0E25\u0E31\u0E19\u0E4C\u0E2D\u0E37\u0E48\u0E2D\u0E2D\u0E25\u0E31\u0E19.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CBankCard.message = \u0E23\u0E31\u0E1A\u0E1A\u0E2D\u0E2B\u0E19\u0E01\u0E32\u0E23\u0E40\u0E01\u0E37\u0E48\u0E2D\u0E1A\u0E1B\u0E23\u0E21\u0E18\u0E35\u0E48\u0E2D\u0E25\u0E37\u0E2D\u0E44\u0E21\u0E48\u0E43\u0E19\u0E2D\u0E31\u0E19.${allowNull == true ? '' : ' \u0E2B\u0E23\u0E37\u0E2D\u0E04\u0E48\u0E32\u0E27\u0E48\u0E32\u0E07'}
com.carpcap.hvp.annotation.CPassport.message = \u0e23\u0e39\u0e1b\u0e41\u0e1a\u0e1a\u0e40\u0e25\u0e02\u0e1e\u0e32\u0e2a\u0e2a\u0e1b\u0e2d\u0e23\u0e4c\u0e15\u0e44\u0e21\u0e48\u0e16\u0e39\u0e01\u0e15\u0e49\u0e2d\u0e07 ${allowNull == true ? '' : ' \u0e2b\u0e23\u0e37\u0e2d\u0e04\u0e48\u0e32\u0e27\u0e48\u0e32\u0e07\u0e40\u0e1b\u0e25\u0e48\u0e32'}
com.carpcap.hvp.annotation.CPostCode.message = \u0e23\u0e39\u0e1b\u0e41\u0e1a\u0e1a\u0e23\u0e2b\u0e31\u0e2a\u0e44\u0e1b\u0e23\u0e29\u0e13\u0e35\u0e22\u0e4c\u0e44\u0e21\u0e48\u0e16\u0e39\u0e01\u0e15\u0e49\u0e2d\u0e07${allowNull == true ? '' : ' \u0e2b\u0e23\u0e37\u0e2d\u0e04\u0e48\u0e32\u0e27\u0e48\u0e32\u0e07'}
