com.carpcap.hvp.annotation.CAccount.message = T\u00E0i kho\u1EA3n kh\u00F4ng h\u1EE3p l\u1EC7. Ph\u1EA7n t\u1EEB \u0111\u1EA7u ph\u1EA7i l\u00E0 ch\u1EEF, d\u1EABy {min}-{max} k\u00ED t\u1EF1 v\u00E0 ch\u1EC9 \u0111\u01B0\u1EE3c ch\u1ECDn ch\u1EEF, s\u1ED1 ho\u1EB7c d\u1EABu g\u1EA7y d\u01B0\u1EE3c.
com.carpcap.hvp.annotation.CDateRange.message = Ng\u00E0y ngo\u00E0i ph\u1EA7n gi\u1EDD h\u1EBFt h\u1EA1n.
com.carpcap.hvp.annotation.CDomain.message = \u0110\u1ECBnh d\u1EA1ng t\u00EAn mi\u1EC7n kh\u00F4ng h\u1EE3p l\u1EC7.
com.carpcap.hvp.annotation.CFile.message = T\u1EAFp tin \u0111\u00E3 t\u1EA3i l\u00EAn kh\u00F4ng \u0111\u00FAt y\u00EAu c\u1EA7u.
com.carpcap.hvp.annotation.CIdCard.message = S\u1ED1 CMND kh\u00F4ng h\u1EE3p l\u1EC7.
com.carpcap.hvp.annotation.CIpv4.message = \u0110\u1ECB\u1EC7c IP kh\u00F4ng tu\u00E2n theo \u0111\u1ECBnh d\u1EA1ng IPv4.
com.carpcap.hvp.annotation.CIpv6.message = \u0110\u1ECBa ch\u1EC9 IP kh\u00F4ng tu\u00E2n th\u1EE7 quy \u0111\u1ECBnh \u0111\u1ECBnh d\u1EA1ng IPv6 (ch\u1EC9 h\u1ED7 tr\u1EE3 IPv6 thu\u1EA7n).
com.carpcap.hvp.annotation.CPassword.message = \u0110\u1ECBnh d\u1EA1ng m\u1EADt kh\u1EA9u kh\u00F4ng \u0111\u00FAng. Y\u00EAu c\u1EA7u \u0111\u1EBF d\u00E0i m\u1EADt kh\u1EA9u {min}-{max}, \u00EDt nh\u1ECF 1 ch\u1EEF, \u00EDt nh\u1ECF 1 s\u1ED1.
com.carpcap.hvp.annotation.CPhone.message = \u0110\u1ECBnh d\u1EA1ng s\u1ED1 \u0111i\u1EC7n tho\u1EA1i di \u0111\u1ED3ng kh\u00F4ng h\u1EE3p l\u1EC7.
com.carpcap.hvp.annotation.CPlateNumber.message = Bi\u1EC3n s\u1ED1 kh\u00F4ng h\u1EE3p l\u1EC7.
com.carpcap.hvp.annotation.CUrl.message = \u0110\u1ECBnh d\u1EA1ng URL kh\u00F4ng h\u1EE3p l\u1EC7.
com.carpcap.hvp.annotation.CMacAddress.message = \u0110\u1ECBnh d\u1EA1ng \u0111\u1ECBa ch\u1EC9 MAC kh\u00F4ng h\u1EE3p l\u1EC7.
com.carpcap.hvp.annotation.CMoney.message = \u0110\u1ECBnh d\u1EA1ng ti\u1EC1n kh\u00F4ng h\u1EE3p l\u1EC7 ho\u1EB7c gi\u00E1 tr\u1ECB n\u1EB1m ngo\u00E0i ph\u1EA1m vi.
com.carpcap.hvp.annotation.CBankCard.message = \u0110\u1ECBnh d\u1EA1ng s\u1ED1 th\u1EBB ng\u00E2n h\u00E0ng kh\u00F4ng h\u1EE3p l\u1EC7.
